artifacts/messages/task2/requestItineraries.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body>
        <ns2:getAvailableItineraries xmlns:ns2="http://service.second.webservice.kth.se/">
            <arg0>12</arg0>
            <arg1>55</arg1>
        </ns2:getAvailableItineraries>
    </S:Body>
</S:Envelope>